In [1]:
import pandas as pd

In [2]:
df_new = pd.read_excel('/program/tft_overview/tft_Tables/data_sheets/result_Sheet.xlsx',index_col=None,
                        dtype={'result_1': str,'result_2': str} )
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   player_name  8 non-null      object
 1   round        8 non-null      int64
 2   group        8 non-null      object
 3   result_1     8 non-null      object
 4   result_2     8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [12]:
df_new= df_new[['player_name','round','group','result_1']]
df_new.rename(columns={"result_1": "result"}, inplace=True)
df_new

       player_name  round group result
0          Cànnà00      1     A      7
1           Donato      1     A      6
2  gelatino spinge      1     A      5
3   James D Savage      1     A      1
4        Xplositor      1     A      4
5         DjemGodx      1     A      2
6      Blyneityles      1     A      3
7     Warlight2015      1     A      8

In [6]:
df_new2 = pd.read_excel('/program/tft_overview/tft_Tables/data_sheets/result_Sheet2.xlsx',index_col=None,
                        dtype={'result': str,'result_2': str} )
df_new2= df_new2[['player_name','round','group','result']]
df_new2

       player_name  round group result
0          Cànnà00      2     A      4
1           Donato      2     A      2
2  gelatino spinge      2     A      8
3   James D Savage      2     A      3
4        Xplositor      2     A      5
5         DjemGodx      2     A      1
6      Blyneityles      2     A      6
7     Warlight2015      2     A      7

In [16]:
df2 = pd.concat([df_new,df_new2])
df2
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16 entries, 0 to 7
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   player_name  16 non-null     object
 1   round        16 non-null     int64
 2   group        16 non-null     object
 3   result       16 non-null     object
dtypes: int64(1), object(3)
memory usage: 640.0+ bytes

In [17]:
df_results = pd.pivot_table(df2,values='result',index='player_name',aggfunc={'result':lambda x : ','.join(x)})

In [22]:
df_results.reset_index(inplace=True)

In [23]:
df_results

       player_name result
0      Blyneityles    3,6
1          Cànnà00    7,4
2         DjemGodx    2,1
3           Donato    6,2
4   James D Savage    1,3
5     Warlight2015    8,7
6        Xplositor    4,5
7  gelatino spinge    5,8

In [31]:
with open("ausgabe_file.txt","w") as o:
    for i in range(len(df_results)): 
        o.write("|p"+ str(i)+"player=" + df_results.iloc[i,0] + " |p" + str(i) + "results=" + df_results.iloc[i,1]+ "\n" )